Revit 2024 API
DirectContext3DHandleSettings Constructor
 Constructs an instance of settings with default values.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public DirectContext3DHandleSettings()
Visual Basic
Public Sub New
Visual C++
public:
DirectContext3DHandleSettings()
See Also
DirectContext3DHandleSettings Class
DirectContext3DHandleSettings Overload
Autodesk.Revit.DB.DirectContext3D Namespace